рядок_з_числами, лічильник = '', 0
for цифра_1 in range(1, 5):
    if цифра_1 == 3:
        continue
    for цифра_2 in range(5):
        if цифра_2 == 3:
            continue
        for цифра_3 in range(5):
            if цифра_3 == 3:
                continue
            лічильник += 1
            рядок_з_числами += str(цифра_1) + str(цифра_2) + str(цифра_3) + ' '
            if лічильник >= 10:
                print(рядок_з_числами)
                рядок_з_числами, лічильник = '', 0

if рядок_з_числами:
    print(рядок_з_числами)
