сумма = 0
лічильник_додатніх = 0
лічильник_відємних = 0
лічильник_усіх = 0

while True:
    число = input('')
    if not число:
        break
    число = int(число)
    if число > 0:
        лічильник_додатніх += 1
    elif число < 0:
        лічильник_відємних += 1
    лічильник_усіх += 1
    сумма += число

if лічильник_усіх:
    середнє = round(сумма / лічильник_усіх, 2)
else:
    середнє = 'не визначено'
print('Додатніх чисел: ' + str(лічильник_додатніх) + "; від'ємних чисел: " + str(лічильник_відємних))
print('Сума усіх чисел: ' + str(сумма) + '; середнє значення: ' + str(середнє))
