import random

# оп = одноманітна послідовність
попередній_кидок, поточна_довжина_оп = None, 0
кидок_найкращої_оп, найкраща_довжина_оп = None, 0
кількість_орлів = 0
for i in range(1_000):
    поточний_кидок = random.randint(0, 1)
    if поточний_кидок:
        кількість_орлів += 1
    if поточний_кидок == попередній_кидок:
        поточна_довжина_оп += 1
    else:
        попередній_кидок = поточний_кидок
        поточна_довжина_оп = 1

    if поточна_довжина_оп > найкраща_довжина_оп:
        найкраща_довжина_оп = поточна_довжина_оп
        кидок_найкращої_оп = попередній_кидок

if кидок_найкращої_оп == 1:
    кидок_найкращої_оп = 'орел'
else:
    кидок_найкращої_оп = 'решка'

print(f'Найбільша довжина одноманітної послідовності: {найкраща_довжина_оп}, сторона: {кидок_найкращої_оп}')
print(f'Загальна кількість орлів: {кількість_орлів}')
