import random
import time

КІЛЬКІСТЬ_ПИТАНЬ = 6

лічильник_правильних = 0
початок = time.time()

for номер_прикладу in range(КІЛЬКІСТЬ_ПИТАНЬ):
    доданок_0 = random.randint(1, 50)
    доданок_1 = random.randint(1, 50)
    правильна_відповідь = доданок_0 + доданок_1
    питання_для_користувача = f'#{номер_прикладу + 1}/{КІЛЬКІСТЬ_ПИТАНЬ} {доданок_0} + {доданок_1} = '
    відповідь_користувача = int(input(питання_для_користувача))
    if відповідь_користувача == правильна_відповідь:
        лічильник_правильних += 1
        print('Правильно')
    else:
        print('Зрада, правильна відповідь була ' + str(правильна_відповідь))
    print()

тривалість = round(time.time() - початок)
відсоток_правильних = round(лічильник_правильних / КІЛЬКІСТЬ_ПИТАНЬ * 100)

print(f'Ви правильно вирішили {відсоток_правильних}% запитань за {тривалість} секунд')
