рядок, лічильник_чисел_у_рядку = '', 0
for число in range(100, 700):
    кількість_дільників = 0
    if число % 7 == 0:
        кількість_дільників += 1
    if число % 13 == 0:
        кількість_дільників += 1
    if число % 66 == 0:
        кількість_дільників += 1

    if кількість_дільників != 1:
        continue

    if рядок:
        рядок += ' '
    рядок += str(число)
    лічильник_чисел_у_рядку += 1

    if лічильник_чисел_у_рядку == 10:
        print(рядок)
        рядок, лічильник_чисел_у_рядку = '', 0

if рядок:
    print(рядок)
