import random

КАМІНЬ, НОЖИЦІ, ПАПІР = 3, 2, 1
людина = int(input('Введіть камінь (3), ножиці (2) або папір (1): '))

ймовірність = random.random()
if ймовірність < 0.60:
    переможець = 'машини'
    if людина == КАМІНЬ:
        машини = 'папір'
    elif людина == НОЖИЦІ:
        машини = 'камінь'
    else:
        машини = 'ножиці'
elif ймовірність < 0.85:
    машини = людина
    переможець = 'ніхто'
else:
    переможець = 'людина'
    if людина == КАМІНЬ:
        машини = 'ножиці'
    elif людина == НОЖИЦІ:
        машини = 'папір'
    else:
        машини = 'камінь'

print('Машини зробили ставку на ' + машини)
if переможець == 'людина':
    print('Ви перемогли, підступні плани машин не увінчалися успіхом, але не варто розслаблятися.')
elif переможець == 'машини':
    print('Ви програли. Термінатор вже виїхав.')
else:
    print('Сили людей и машин виявилися рівними цього разу.')
