КАМІНЬ, НОЖИЦІ, ПАПІР = 3, 2, 1

гравець_1 = int(input('Що загадав перший гравець? Введіть камінь (3), ножиці (2) або папір (1): '))
гравець_2 = int(input('Що загадав ДРУГИЙ гравець? Введіть камінь (3), ножиці (2) або папір (1): '))

if гравець_1 > гравець_2:
    переможець = 'перший гравець'
    if гравець_1 == КАМІНЬ and гравець_2 == ПАПІР:
        переможець = 'другий гравець'
elif гравець_1 < гравець_2:
    переможець = 'другий гравець'
    if гравець_2 == КАМІНЬ and гравець_1 == ПАПІР:
        переможець = 'перший гравець'
else:
    переможець = 'ніхто'

if переможець == 'ніхто':
    print('Нічия')
else:
    print('Переміг ' + переможець)
