сума = int(input('Введіть суму: '))

if сума <= 0:
    print('Сума має бути більшою за нуль')
else:
    кількість_монет_по_50 = сума // 50
    сума %= 50
    if кількість_монет_по_50:
        print('Монет по 50 копійок: ' + str(кількість_монет_по_50))

    кількість_монет_по_25 = сума // 25
    сума %= 25
    if кількість_монет_по_25:
        print('Монет по 25 копійок: ' + str(кількість_монет_по_25))

    кількість_монет_по_10 = сума // 10
    сума %= 10
    if кількість_монет_по_10:
        print('Монет по 10 копійок: ' + str(кількість_монет_по_10))

    кількість_монет_по_5 = сума // 5
    сума %= 5
    if кількість_монет_по_5:
        print('Монет по 5 копійок: ' + str(кількість_монет_по_5))

    if сума:
        print('Монет по 1 копійці: ' + str(сума))
