import random

доданок_0 = random.randint(1, 50)
доданок_1 = random.randint(1, 50)
правильна_відповідь = доданок_0 + доданок_1
питання_для_користувача = str(доданок_0) + ' + ' + str(доданок_1) + ' = '
відповідь_користувача = int(input(питання_для_користувача))
if відповідь_користувача == правильна_відповідь:
    print('Перемога')
elif відповідь_користувача / правильна_відповідь > 50:
    print('Щось ви вкрай помилились. Мабуть ви ще вважаєте що усім українським вчителям можна виплачувати зарплатню у $4000')
else:
    print('Зрада, правильна відповідь була ' + str(правильна_відповідь))
