import time

СЕКУНД_У_ХВИЛИНІ = 60
приклад_тексту = 'А завзяття, праця щира свого ще докаже'
print('Приклад тексту: "' + приклад_тексту + '"')
print('Найменша допустима довжина тексту: ' + str(len(приклад_тексту)) + ' символів')
input('Коли будете готові, натисніть Enter, введіть текст, і тоді знов натисніть Enter')

початковий_час = time.time()
текст = input('ПОЧИНАЙТЕ: ')
if len(текст) < len(приклад_тексту):
    print('Ви ввели замало символів для надійної оцінки швидкості')
else:
    тривалість_у_хвилинах = (time.time() - початковий_час) / СЕКУНД_У_ХВИЛИНІ
    швидкість = len(текст) / тривалість_у_хвилинах
    print('Швидкість вашого набору складає ' + str(round(швидкість, 2)) + ' знаків на хвилину')
