import random

РОЗМІР_ДОШКИ = 8
дошка = list()
ПУСТИЙ_РЯДОК = list()
for j in range(РОЗМІР_ДОШКИ):
    ПУСТИЙ_РЯДОК.append(False)
for i in range(РОЗМІР_ДОШКИ):
    рядок = list(ПУСТИЙ_РЯДОК)
    рядок[i] = True
    дошка.append(рядок)

лічильник_спроб = 0
рішення_знайдене = False
while not рішення_знайдене:
    random.shuffle(дошка)
    лічильник_спроб += 1
    МЕТА_ПАРАМЕТРИ = (
        ('різниця', range(1 - РОЗМІР_ДОШКИ, РОЗМІР_ДОШКИ)),
        ('сума', range(2 * РОЗМІР_ДОШКИ - 1)),
    )
    рішення_знайдене = True
    for тип_діагоналі, діапазон in МЕТА_ПАРАМЕТРИ:
        for параметр_діагоналі in діапазон:
            ферзів_на_діагоналі = 0
            for i in range(РОЗМІР_ДОШКИ):
                for j in range(РОЗМІР_ДОШКИ):
                    if тип_діагоналі == 'сума':
                        if i + j == параметр_діагоналі:
                            ферзів_на_діагоналі += дошка[i][j]
                    elif тип_діагоналі == 'різниця':
                        if i - j == параметр_діагоналі:
                            ферзів_на_діагоналі += дошка[i][j]
            if ферзів_на_діагоналі > 1:
                рішення_знайдене = False

print(f'Пошук зайняв {лічильник_спроб} спроб')
for рядок in дошка:
    print(end='|')
    for клітина in рядок:
        символ = 'Q' if клітина else ' '
        print(символ, end='|')
    print()
