РОЗМІР_ДОШКИ = 8

МЕТА_ПАРАМЕТРИ = (
    ('різниця', range(1 - РОЗМІР_ДОШКИ, РОЗМІР_ДОШКИ)),
    ('сума', range(2 * РОЗМІР_ДОШКИ - 1)),
)

for тип_діагоналі, діапазон in МЕТА_ПАРАМЕТРИ:
    for параметр_діагоналі in діапазон:
        print()
        for i in range(РОЗМІР_ДОШКИ):
            print(end='|')
            for j in range(РОЗМІР_ДОШКИ):
                символ = ' '
                if тип_діагоналі == 'сума':
                    if i + j == параметр_діагоналі:
                        символ = 'D'
                elif тип_діагоналі == 'різниця':
                    if i - j == параметр_діагоналі:
                        символ = 'D'
                print(символ, end='|')
            print()
