СПИСКИ_ЯК_РЯДКИ = [
    '0 1 2 3, 4 5 6',
    '1 1 3 5, 2 4 6',
    '2 4 6, 1 3 5 6 7',
    '2 4 66, 1 3 66 66',
    '6 66 666, 1 1 1 2',
    '3 10 11 18, 1 8 10 11 13 23'
]

for список_як_рядок in СПИСКИ_ЯК_РЯДКИ:
    список_А, список_Б = список_як_рядок.split(',')
    список_А = список_А.split()
    список_Б = список_Б.split()
    for список in [список_А, список_Б]:
        for j in range(len(список)):
            список[j] = int(список[j])

    результат = list()
    індекс_Б = 0
    for елемент_А in список_А:
        for індекс_Б in range(індекс_Б, len(список_Б)):
            if список_Б[індекс_Б] < елемент_А:
                результат.append(список_Б[індекс_Б])
                індекс_Б += 1
            else:
                break
        результат.append(елемент_А)
    результат += список_Б[індекс_Б:]
    print(f'{список_як_рядок} -> {результат}')
