import random

random.seed(1234)

випадкові_списки = list()
for _ in range(10):
    випадкові_списки.append(list())
    for i in range(random.randint(6, 20)):
        випадкові_списки[-1].append(random.randint(1, 16))

for список_чисел in випадкові_списки:
    індекс_першого_найбільшого = -1
    # напишіть тут код який буде правильно присвоювати значення у змінну індекс_першого_найбільшого
    print(f'індекс={індекс_першого_найбільшого}, значення={список_чисел[індекс_першого_найбільшого]}, список={список_чисел}')
