import random

random.seed(1234)

випадкові_списки = list()
for _ in range(10):
    випадкові_списки.append(list())
    for i in range(random.randint(6, 20)):
        випадкові_списки[-1].append(random.randint(1, 16))

for список in випадкові_списки:
    індекс_першого_найбільшого = 0
    for i in range(1, len(список)):
        if список[i] > список[індекс_першого_найбільшого]:
            індекс_першого_найбільшого = i
    print(f'індекс={індекс_першого_найбільшого}, значення={список[індекс_першого_найбільшого]}, список={список}')
