НИЖНІ_МЕЖІ = [10, 20, 30, 40]
ОЦІНКИ = ['A', 'B', 'C', 'D']
бали = input('Введіть бали, розділені пробілом: ')
бали = бали.split()

if бали:
    кращий_бал = None
    for індекс_балу in range(len(бали)):
        бали[індекс_балу] = int(бали[індекс_балу])
        if not кращий_бал or бали[індекс_балу] > кращий_бал:
            кращий_бал = бали[індекс_балу]

    for індекс_балу in range(len(бали)):
        оцінка = 'F'
        for індекс_оцінки in range(len(НИЖНІ_МЕЖІ)):
            if бали[індекс_балу] >= кращий_бал - НИЖНІ_МЕЖІ[індекс_оцінки]:
                оцінка = ОЦІНКИ[індекс_оцінки]
                break
        print(f'У студента #{індекс_балу} {бали[індекс_балу]} балів, а оцінка - {оцінка}')
