import random

random.seed(1234)

випадкові_списки = [
    '1 2 3 4 5 666 666',
    '1 2 3 2 1',
    '-1 1 2 -3',
    '-1234.99 8 9 10 100500 666666',
]


for список_як_рядок in випадкові_списки:
    список = список_як_рядок.split()
    for i in range(len(список)):
        список[i] = float(список[i])
    відсортований = True
    for i in range(1, len(список)):
        if список[i - 1] > список[i]:
            відсортований = False
            break
    print(f'Відсортований: {відсортований}, список: {список_як_рядок}')
