НАЙБІЛЬШЕ_ЧИСЛО = 100
списки_чисел = [
    '0 100 100 88 2 2 2 22 31 48 59',
    '66 66 66',
    '1 2 3 66 66 66 77 77 77 51 51 51 1 2 3 12 3',
    '1 1 1 91 91 91 2 2 2 2 2 2 2 2 2 2 2 2 77 47 31',
    '1 1 1 91 91 91 2 2 2 2 2 2 2 2 2 2 2 2 77 47 31 18 18 18 18 18 18 18 18',
]

for числа in списки_чисел:
    print(f'числа: {числа}')
    лічильники = [0] * (НАЙБІЛЬШЕ_ЧИСЛО + 1)

    for число in числа.split():
        число = int(число)
        лічильники[число] += 1

    print('лічильники: ', end='')
    for число in range(НАЙБІЛЬШЕ_ЧИСЛО + 1):
        лічильник = лічильники[число]
        if лічильник:
            print(f'{число}: {лічильник}, ', end='')
    print()
    print()
