import random

РОЗМІР_ПОЛЯ = 3
ЗНАК_КОРИСТУВАЧА = '0'
ЗНАК_МАШИН = 'X'
ПЕРЕМОЖНА_МНОЖИНА = [{ЗНАК_КОРИСТУВАЧА}, {ЗНАК_МАШИН}]
поле = [
    [None, None, None],
    [None, None, None],
    [None, None, None],
]

поле_виведено = False
for номер_ходу in range(РОЗМІР_ПОЛЯ ** 2):
    if номер_ходу % 2 == 0:  # першими ходять машини, ходи 0, 2, 4, 6, 8
        while True:
            рядок, колонка = random.randint(0, 2), random.randint(0, 2)
            if поле[рядок][колонка]:
                # якщо випадковий генератор влучив у зайняту клітинку ми пробуємо перегенерувати
                continue
            поле[рядок][колонка] = ЗНАК_МАШИН
            break  # машини зробили свій хід, зупиняємо спроби генерації

        # виводимо ігрове поле на екран щоб гравець міг бачити оновлений стан поля
        for рядок in поле:
            for символ in рядок:
                # якщо клітинка не заповнена, ми виводимо нижній прочерк
                print(символ or '_', end=' ')
            print()
        поле_виведено = True
    else:  # після машин ходить гравець - ходи 1, 3, 5, 7
        while True:
            ввід_користувача = input('Введіть ваш хід: ')
            рядок, колонка = ввід_користувача.split()
            рядок, колонка = int(рядок), int(колонка)
            if поле[рядок][колонка]:
                # гравець помилився і вибрав зайняту клітинку
                print('Ця клітинка зайнята, будь-ласка оберіть іншу')
                continue
            поле[рядок][колонка] = ЗНАК_КОРИСТУВАЧА
            break
        поле_виведено = False

    # час визначити переможця
    переможна_послідовність_як_множина = None

    # шукаємо чи є переможний рядок
    for рядок in поле:
        # рядок є переможним якщо у ньому є або лише хрестики або нулики,
        # тобто його презентація у вигляді множини виглядає як {'X'} або {'0'}
        if set(рядок) in ПЕРЕМОЖНА_МНОЖИНА:
            переможна_послідовність_як_множина = set(рядок)

    # шукаємо чи є переможна колонка
    for номер_колонки in range(РОЗМІР_ПОЛЯ):
        колонка = set()
        for номер_рядку in range(РОЗМІР_ПОЛЯ):
            колонка.add(поле[номер_рядку][номер_колонки])
        if колонка in ПЕРЕМОЖНА_МНОЖИНА:
            переможна_послідовність_як_множина = колонка

    # визначаємо чи є переможною головна діагональ
    діагональ = set()
    for i in range(РОЗМІР_ПОЛЯ):
        діагональ.add(поле[i][i])
    if діагональ in ПЕРЕМОЖНА_МНОЖИНА:
        переможна_послідовність_як_множина = діагональ

    # визначаємо чи є переможною друга діагональ
    інша_діагональ = set()
    for i in range(РОЗМІР_ПОЛЯ):
        інша_діагональ.add(поле[i][РОЗМІР_ПОЛЯ - 1 - i])
    if інша_діагональ in ПЕРЕМОЖНА_МНОЖИНА:
        переможна_послідовність_як_множина = інша_діагональ

    # якщо є переможець, зупиняємо гру
    if переможна_послідовність_як_множина:
        break

    усі_символи_поля = set()
    for рядок in поле:
        усі_символи_поля.update(рядок)
    # усе заповнено, нема куди ходити, закінчуємо гру навіть коли переможця немає
    if None not in усі_символи_поля:
        break

if not поле_виведено:
    for рядок in поле:
        for символ in рядок:
            print(символ or '_', end=' ')
        print()

if переможна_послідовність_як_множина == {ЗНАК_КОРИСТУВАЧА}:
    print('Ви перемогли, підступні плани машин не увінчалися успіхом, але не варто розслаблятися.')
elif переможна_послідовність_як_множина == {ЗНАК_МАШИН}:
    print('Ви програли. Термінатор вже виїхав.')
else:
    print('Сили людей и машин виявилися рівними цього разу.')
