import random

РОЗМІР_ПОЛЯ = 3
ЗНАКИ = ('X', '0')
поле = [
    [None, None, None],
    [None, None, None],
    [None, None, None],
]

послідовність_ходів = list()
for рядок in range(РОЗМІР_ПОЛЯ):
    for колонка in range(РОЗМІР_ПОЛЯ):
        послідовність_ходів.append((рядок, колонка))
random.shuffle(послідовність_ходів)

for номер_ходу in range(РОЗМІР_ПОЛЯ ** 2):
    рядок, колонка = послідовність_ходів[номер_ходу]
    поле[рядок][колонка] = ЗНАКИ[номер_ходу % 2]

    for рядок in поле:
        for символ in рядок:
            print(символ or '_', end=' ')
        print()
    print()
